Repository: 84000/data-translation-memory
Catalog: Toh_147-The_Teaching_on_the_Great_Compassion_of_the_Tathagata-v1.tmx
Source language: bo
Languages: en

source: གང་ཕྱིར་ཉོན་མོངས་ཀུན་འདོར་འདི་ནི་ཤེས་རབ་ལས། །
en: Its function is to let go of all afflictive emotions.

source: ཚུལ་ཁྲིམས་ཤིན་ཏུ་དག་པ་དྲན་འདི་ཤེས་རབ་རྩ། །
en: “Recollecting pure moral conduct is a source of insight.

source: ཚུལ་ཁྲིམས་ཟག་པ་མེད་ལ་གནས་ནི་ཤེས་རབ་ལས། །
en: Its function is to abide in unsullied moral conduct.

source: ཆེ་བའི་བདག་ཉིད་ལྷ་དྲན་འདི་ནི་ཤེས་རབ་རྩ། །
en: Recollecting the gods, the great beings, is a source of insight.

source: དག་ནས་དག་པ་དྲན་པ་འདི་ནི་ཤེས་རབ་ལས། །
en: Its function is to recollect the purest of the pure.

source: གང་ཕྱིར་བསྒྲིམས་ཏེ་ཐོས་པ་ཚོལ་བ་ཤེས་རབ་རྩ། །
en: “Scrutinizing what has been learned with focused attention is a source of insight.

source: གཞན་དག་ལས་ནི་ཕྱིས་མི་ཚོལ་བ་ཤེས་རབ་ལས། །
en: Its function is not to scrutinize later what has come from others.

source: ལེགས་པར་བྱེད་པའི་ལས་བྱེད་འདི་ནི་ཤེས་རབ་རྩ། །
en: Performing virtuous actions is a source of insight.

source: ལས་ཕྱིས་མངོན་པར་འདུ་མི་བྱེད་པ་ཤེས་རབ་ལས། །
en: Its function is to know that actions do not manifest later.

source: ང་རྒྱལ་མེད་ཅིང་འདུད་པར་བྱེད་པ་ཤེས་རབ་རྩ། །
en: “Acting respectfully without pride is a source of insight.

source: ཡེ་ཤེས་ཆེ་བའི་བདག་ཉིད་ཐོབ་འདི་ཤེས་རབ་ལས། །
en: Its function is to attain the nature of great wisdom.

source: བདག་གི་དོན་ལ་བརྩོན་འགྱུར་འདི་ནི་ཤེས་རབ་རྩ། །
en: Striving for one’s own benefit is a source of insight.

source: སེམས་ཅན་རྣམས་ཀྱི་དོན་བྱེད་འདི་ནི་ཤེས་རབ་ལས། །
en: Its function is to act for the benefit of sentient beings.

source: གལ་ཏེ་ཆོས་ཀྱི་ཕུང་པོ་འཛིན་བྱེད་ཤེས་རབ་རྩ། །
en: “Upholding the collections of the Dharma is a source of insight.

source: སེམས་ཅན་སྤྱོད་པ་རྗེས་སུ་རྟོགས་བྱེད་ཤེས་རབ་ལས། །
en: Its function is to foster understanding regarding the behavior of beings.

source: གཞན་གྱི་བློ་ལ་ཡང་དག་ཐོབ་བྱེད་ཤེས་རབ་རྩ། །
en: Fostering spiritual attainment in the minds of others is a source of insight.

source: སེམས་ཅན་ཐེག་གསུམ་ངེས་འབྱུང་བྱེད་པ་ཤེས་རབ་ལས། །
en: Its function is to bring them to deliverance through the three vehicles.

source: བློ་གྲོས་ལྡན་པ་སྦྱིན་དང་སྙན་པར་སྨྲ་བ་དང་། །
en: “For wise ones to mature beings by generosity,

source: དོན་བྱེད་སེམས་ཅན་ཡོངས་སུ་སྨིན་བྱེད་ཤེས་རབ་རྩ། །
en: Speaking pleasantly, and working for their benefit is a source of insight.

source: གལ་ཏེ་དོན་འཐུན་པ་ཡིས་སངས་རྒྱས་ཡོན་ཏན་འགོད། །
en: Its function is for noble beings to display buddha qualities

source: འདི་ནི་སྐྱེས་བུ་དམ་པ་རྣམས་ཀྱི་ཤེས་རབ་ལས། །
en: Through alignment with beings’ aims.

source: སྲིད་པ་ཀུན་དུ་འབར་ཤེས་སྐྲག་པ་ཤེས་རབ་རྩ། །
en: “Being intimidated by the knowledge that existence is an inferno is a source of insight.

source: མི་སྐྱེ་བཟོད་པ་ཐོབ་པ་དེ་ནི་ཤེས་རབ་ལས། །
en: Its function is to attain acceptance of the unoriginated.

source: ཕྱིར་མི་ལྡོག་པའི་ས་འདི་ཤེས་རབ་རྩ་བ་སྟེ། །
en: The level of nonregression is a source of insight.

source: དབང་བསྐུར་དེ་ཡི་ས་ཐོབ་དེ་ནི་ཤེས་རབ་ལས། །
en: Its function is to attain the level of empowerment.

source: གལ་ཏེ་བྱང་ཆུབ་ཤིང་དྲུང་འདུག་པ་ཤེས་རབ་རྩ། །
en: “Standing in front of the tree of awakening is a source of insight.

source: ཀུན་མཁྱེན་ཡེ་ཤེས་རེག་པ་འདི་ནི་ཤེས་རབ་ལས། །
en: Its function is to attain omniscient wisdom.

source: བྱང་ཆུབ་སེམས་འདི་ཤེས་རབ་རྩ་བ་ཞེས་ཀྱང་བྱ། །
en: The so-called thought of awakening is itself known to be a source of insight.

source: སེམས་ནི་གནས་སུ་གང་བྱེད་དེ་ནི་ཤེས་རབ་ལས། །
en: Its function is to bring about whatever one sets one’s mind to.

source: གང་དག་བྱང་ཆུབ་སེམས་ལ་རྟག་གནས་མི་གཡོ་བ། །
en: “Those who are unwavering and abide constantly in the thought of awakening

source: དེ་དག་ཤེས་རབ་ཀྱིས་ནི་རྟག་ཏུ་ལས་བྱ་བྱེད། །
en: Consistently perform the function of insight.

source: རྩ་བ་འདི་འདྲ་བྱང་ཆུབ་སྤྱོད་པ་མཆོག་གི་སེམས། །སངས་རྒྱས་སྟོབས་དང་དེ་བཞིན་སོ་སོ་ཡང་དག་རིག །དེ་ཡི་བསྔགས་པ་བསྐལ་པ་བྱེ་བ་མང་བརྗོད་ཀྱང་། །སངས་རྒྱས་ཡོན་ཏན་མཐའ་མར་ཐུག་པར་འགྱུར་བ་མེད། །
en: Were one to praise such a source—the supreme thought of awakened conduct, Buddha strengths, and discriminating knowledge— For many thousands of eons, One would never reach the end of buddha qualities.

source: གང་དག་འདས་པའི་བདེ་གཤེགས་དེ་བཞིན་ད་ལྟར་བྱུང་། །
en: “Sugatas of the past, as well as the present

source: གང་དག་མ་འོངས་པ་དང་ཕྱོགས་བཅུའི་ཐུབ་དབང་པོ། །ཚད་མེད་པ་ལ་བསྙེན་བཀུར་ཚད་མེད་བྱེད་འདོད་གང་། །དེ་ནི་མ་མྱོས་བྱང་ཆུབ་སེམས་ལ་དགའ་བ་ཡིན། །
en: And the future, along with the capable ones of the ten directions— Those who wish to perform immeasurable service to these immeasurable beings Take a sober delight in the thought of awakening.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་གཟུངས་ཀྱི་དབང་ཕྱུག་གི་རྒྱལ་པོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Thereupon, the bodhisattva Dhāraṇīśvara­rāja said,

source: བཅོམ་ལྡན་འདས། ཀྱེ་མ་ཇི་ཙམ་དུ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་འདི་ཤིན་ཏུ་རྣམ་པར་ངེས་ཤིང་།
en: “Alas, Blessed One! The full extent of this unsurpassed complete and perfect awakening of the blessed buddhas has been precisely ascertained.

source: ཡི་གེ་རྣམས་ཀྱིས་བསྟན་པ་མཐའ་ཡས་པ། དོན་གྱིས་འཇུག་པ་མཐའ་ཡས་པ། མི་བརྩོན་པ་རྣམས་ཀྱིས་འཇུག་པར་དཀའ་བ།
en: What is taught by way of words is infinite, and what is accessed by way of meanings is infinite, yet it is difficult to access by those who are not diligent.

source: རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་རྗེས་སུ་རྟོགས་པས་ཟབ་པ།
en: It is profound since it is realized in accordance with dependent arising.

source: གཉིས་ལ་སྤྱོད་པ་རྣམས་ཀྱིས་འཚལ་བར་དཀའ་བ།
en: It is difficult to fathom by those who engage in duality.

source: སྐྱེ་མཆེད་དྲུག་ལ་བརྟེན་པ་རྣམས་ཀྱིས་མཐོང་བར་དཀའ་བ།
en: It is difficult to see for those who rely on the six sense fields.

source: ཐེག་པ་དམན་པ་ལ་མོས་པ་རྣམས་ཀྱིས་ཡིད་ཆེས་པར་དཀའ་བ།
en: It is difficult to trust for those dedicated to the lower vehicles.

source: ཉན་ཐོས་དང་རང་སངས་རྒྱས་རྣམས་ཀྱིས་མ་ལགས་པ། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྤྱོད་ཡུལ།
en: It is not for śrāvakas or pratyekabuddhas but is the provenance of bodhisattvas.

source: ཆོས་ཐམས་ཅད་ཀྱི་ཕྱག་རྒྱ།
en: “This awakening is the seal of all phenomena.

source: ཆོས་ཀྱི་དབྱིངས་མཉམ་པ་ཉིད་པས་ཕྱེ་བ་མ་མཆིས་པ།
en: It is the equality of the realm of phenomena and thus inseparable from it.

source: ནམ་མཁའི་མཚན་ཉིད་ཀྱི་སླད་དུ་འགྱུར་བ་མ་མཆིས་པ།
en: Having the characteristic of space, it does not become defiled.

source: ཤིན་ཏུ་འདས་པས་ཀུན་གཞི་མ་མཆིས་པ།
en: Since it is totally transcendent, it is not a substratum.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྤྱོད་པ་རབ་ཏུ་ཤེས་པ། རྒྱུ་ཐམས་ཅད་ཡོངས་སུ་ཤེས་པ།
en: It has knowledge of the behaviors of all sentient beings and knowledge of all causes.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྣང་བ།
en: “This awakening is the illumination of the perfection of wisdom.

source: ངེས་པར་འབྱུང་བ་རྣམས་ཀྱི་འབྱུང་བ།
en: It is the source of deliverance.

source: དགེ་བའི་རྩ་བ་རྣམས་ཀྱི་ཐབས།
en: It is the method of the roots of virtue.

source: སོ་སོ་ཡང་དག་པར་རིག་པ་ཐོབ་པ་རྣམས་ཀྱིས་རྣམ་པར་དབྱེ་བར་བགྱི་བ།
en: It is what is discerned by those who have attained discriminating knowledge.

source: མངོན་པར་ཤེས་པ་ཐོབ་པ་རྣམས་ཀྱིས་རྣམ་པར་དགྲོལ་བར་བགྱི་བ།
en: It liberates those who have attained superknowledge.

source: ཚུལ་གཅིག་ལ་གནས་པ་རྣམས་ཀྱིས་མཉམ་པ་ཉིད་དུ་རྟོགས་པར་བགྱི་བ།
en: “This awakening consists in the realization of equality by those who abide in the single way.

source: སྣ་ཚོགས་མ་མཆིས་པར་སྤྱོད་པ་རྣམས་ལ་ཁྱད་པར་མ་མཆིས་པ།
en: Not being multifarious, it is not differentiated among practitioners.

source: ནམ་མཁའ་དང་མཉམ་པ་ཉིད་པས་མཉམ་པ།
en: Since it is the same as space, it is equal.

source: གཉེན་པོ་མ་མཆིས་པས་མཉམ་པ་མ་མཆིས་པ།
en: But since is not a counteragent, it is unequal.

source: སངས་རྒྱས་ཐམས་ཅད་དང་མཉམ་པ་ཉིད་པས་མི་མཉམ་པ་དང་མཉམ་པ།
en: Since it is equal to all buddhas, it is both equal and unequal.

source: འགོག་པས་རབ་ཏུ་ཕྱེ་བས་གཉིས་དང་བྲལ་བ།
en: Since it is distinguished by way of cessation, it is free of dualism.

source: ཡི་གེ་རྣམས་ཀྱིས་དཔྱད་དུ་མ་མཆིས་པ།
en: It is not something to be analyzed by letters.

source: དོན་གྱི་ཡང་དག་པར་བཞག་པ།
en: “This awakening is truly established as real.

source: སྒྲས་རྣམ་པར་རིག་པར་བགྱི་བ། དོན་དམ་པར་བརྗོད་དུ་མ་མཆིས་པ།
en: It is something known by language, yet ultimately it does not exist as something expressible.

source: ཀུན་རྫོབ་ཏུ་མཆིས་པ། དཀོན་མཆོག་གསུམ་གྱི་མཐུ་དང་ལྡན་པ། ཐེག་པ་གསུམ་ལ་རྣམ་པར་རྟོག་པ། རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་པོ་དག་རབ་ཏུ་སྟོན་པ། ཁམས་གསུམ་པ་ལས་ཤིན་ཏུ་འདས་པ། རིག་པ་གསུམ་པོ་དག་ཁོང་དུ་ཆུད་པར་བགྱིད་པ།
en: It exists conventionally, it is endowed with the might of the Three Jewels, it is conceived of in terms of the three vehicles, it is shown to be the three gates of liberation, it totally transcends the three realms, and it consists in the comprehension of threefold awareness.

source: རྡོ་རྗེ་ལྟ་བུའི་ཏིང་ངེ་འཛིན་བསྐྱེད་པ།
en: “This awakening generates the vajra-like absorption.

source: ཆོས་ཐམས་ཅད་ཀྱི་གནས།
en: It is the abode of all phenomena.

source: སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་ལས་བྱུང་བ།
en: It has arisen from the wisdom of the Buddha.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉེ་བར་འཚོ་བ།
en: It is the sustenance of all beings.

source: སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་གསལ་བར་མཛད་པ་ནི་ངོ་མཚར་ཏོ། །
en: Being made clearly present by all buddhas, it is truly wonderful!

source: བཅོམ་ལྡན་འདས་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་དག་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་བྱང་ཆུབ་བསྟན་པ་ཚད་མ་མཆིས་པ་འདི་ལ་མོས་པར་བགྱིད་པ་དང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་སེམས་སྐྱེད་པར་བགྱིད་པ་དང་། དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བའི་སླད་དུ་མདོ་སྡེ་འདི་ལྟ་བུ་འདི་མཉན་པར་བགྱིད་པ་དང་། མོས་པར་བགྱིད་པ་དང་། འཛིན་པ་དང་། འཆང་བ་དང་། ཀློག་པ་དང་། ཀུན་ཆུབ་པར་བགྱིད་པ་དང་། གཞན་དག་ལ་ཡང་རྒྱས་པར་ཡང་དག་པར་སྟོན་པར་བགྱིད་པ་དེ་དག་ནི་བཅོམ་ལྡན་འདས་བསོད་ནམས་མང་དུ་སྐྱེད་པ་ལགས་སོ། །
en: “Blessed One, sons or daughters of noble family who have faith in this vast account of the awakening of the blessed buddhas, who generate the thought of unsurpassed complete and perfect awakening, who listen to this sūtra in order to retain the holy Dharma, who are faithful, and who recollect it, uphold it, read it, master it, or teach it in detail to others—they, Blessed One, will generate a vast amount of merit.

source: དེ་བཞིན་གཤེགས་པ་རྣམས་ལ་ཡང་བྱས་པ་གཟོ་བ་དང་། བྱས་པ་འཚལ་བ་ལགས་སོ། །
en: They will thereby pay homage to and repay the kindness of the tathāgatas.”

source: རིགས་ཀྱི་བུ་དེ་དེ་བཞིན་ནོ། །
en: “That is correct, son of noble family.

source: ཇི་སྐད་སྨྲས་པ་བཞིན་ཏེ། དེ་དག་བསོད་ནམས་མང་དུ་སྐྱེད་པར་འགྱུར་རོ། །
en: It is just as you have said: these beings will indeed generate a vast amount of merit.

source: རིགས་ཀྱི་བུ་གང་གིས་དེ་བཞིན་གཤེགས་པའི་སྤྱན་གྱིས་གཟིགས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱིས་རབ་ཏུ་བཀང་སྟེ། དེ་བཞིན་གཤེགས་པ་རྣམས་ལ་སྦྱིན་པ་བྱིན་པ་བས་གང་གིས་དམ་པའི་ཆོས་ཡོངས་སུ་བཟུང་བ་དང་། དཀོན་མཆོག་གསུམ་རྒྱུན་མི་འཆད་པར་བྱ་བའི་ཕྱིར་མདོ་སྡེ་འདི་ལྟ་བུ་འདི་ཉན་ཏམ། མོས་སམ། འཛིན་ཏམ། འཆང་ངམ། ཀློག་གམ། ཀུན་ཆུབ་པར་བྱེད་དམ། སྟོན་ཏམ། གཞན་དག་ལ་ཡང་རྒྱས་པར་ཡང་དག་པར་སྟོན་ཏམ། བསྒོམ་པའི་རྣལ་འབྱོར་ལ་བརྩོན་པར་གནས་ན་འདི་ནི་དེ་བས་བསོད་ནམས་ཆེས་མང་དུ་སྐྱེད་དོ། །
en: Some may fill all buddhafields visible to the tathāgata eye with all jewels and offer them to the tathāgatas, but if others, in order to uphold the holy Dharma and ensure the continuity of the Three Jewels, were to listen to this sūtra, have faith in it, retain it, uphold it, read it, master it, teach it in detail to others, or diligently persist in the yoga of cultivating it—these beings would generate a much larger amount of merit.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་བཀའ་སྩལ་ཏོ། །
en: Then the Blessed One uttered these verses:

source: སངས་རྒྱས་སྤྱན་གྱིས་ཞིང་གང་ངས་མཐོང་བ། །རིན་ཆེན་བཀང་སྟེ་དེ་བཞིན་གཤེགས་བྱིན་ཡང་། །འདི་ལྟ་བུ་ཡི་ཆོས་འདི་མ་ཐོས་ན། །
en: “If some were to fill the fields that I behold with buddha eyes With jewels and offer them to the Tathāgata, But fail to listen to this teaching,

source: དེ་ནི་བསོད་ནམས་ཆུང་ཞེས་ང་སྨྲའོ། །
en: I declare that their merit would be small.

source: གང་གིས་དམ་པའི་དོན་ལྡན་ཕྲ་ཟབ་པ། །མདོ་སྡེ་བཟང་པོ་འདི་ནི་ཐོས་གྱུར་ན། །ཀུན་དུ་འཛིན་ཅིང་བཟུང་ནས་ཀློག་བྱེད་པ། །
en: “If others were to hear this good sūtra, which is subtle and profound And embodies the ultimate truth, And were to retain, uphold, and read it,

source: འདི་ནི་དེ་བས་བསོད་ནམས་མཆོག་ཏུ་འཕགས། །
en: Their merit would be far superior.

source: འདི་ལྟར་རྒྱལ་བའི་ཆོས་ཀྱིས་ཉེར་གནས་ཤིང་། །ཆོས་ཀྱིས་ངེས་པར་འབྱུང་གི་ཟང་ཟིང་མིན། །
en: “Thus, attainment through the Victor’s Dharma And deliverance through the Dharma are not trifling things.

source: དེ་བས་གང་ཞིག་བདེ་གཤེགས་ཆོས་འཛིན་པ། །དེ་ནི་སངས་རྒྱས་ཀུན་ལ་བྱས་པ་གཟོ། །
en: Those who thereby uphold the Sugata’s Dharma Repay the kindness of all buddhas.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཆེན་པོ་དེ་ལ་བཀའ་སྩལ་པ།
en: Then the Blessed One asked the great bodhisattva assembly,

source: སྐྱེས་བུ་དམ་པ་དག་ཁྱེད་ཀྱི་ནང་ནས་ང་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་ཕྱིན་དམ་པའི་ཆོས་ཡུན་རིང་དུ་གནས་པར་བྱ་བའི་ཕྱིར་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་རྒྱས་པར་བྱ་བ་དང་། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་བྱང་ཆུབ་འདི་ཡོངས་སུ་བསྲུང་བར་སུ་སྤྲོ།
en: “Noble beings, when I pass into nirvāṇa, who among you would like to expound this Dharma discourse and safeguard the awakening of the blessed buddhas in order to ensure the continuity of the holy Dharma?”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའི་འཁོར་དེའི་ནང་ནས་བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཕྲག་དྲུག་ཅུས་མགྲིན་གཅིག་ཏུ་ཚིག་སྨྲས་པ།
en: Among the bodhisattva assembly, sixty billion bodhisattvas said with one voice,

source: བཅོམ་ལྡན་འདས་བདག་ཅག་རྣམས་དེ་བཞིན་གཤེགས་པའི་བྱང་ཆུབ་བསྐལ་པ་གྲངས་མ་མཆིས་པར་བསྒྲུབས་པ་འདི་འཛིན་པ་དང་། སླད་མའི་ཚེ་སླད་མའི་དུས་དེ་ན་ཡང་རྒྱས་པར་བགྱིད་པར་སྤྲོའོ། །
en: “Blessed One, we will retain the awakening of the Tathāgata, accomplished within countless eons, and we would like to expound it in future times as well.

source: བཅོམ་ལྡན་འདས་འོན་གྱིས་ཀྱང་ཅི་ནས་དེའི་དུས་ན་སྐྱེ་བོ་མང་པོ་གནས་པར་འགྱུར་བ། དགེ་བའི་རྩ་བ་བསྐྲུན་པའི་སེམས་ཅན་དེ་དག་གི་རྣ་བར་གྲགས་པར་འགྱུར་བར་དེ་བཞིན་གཤེགས་པས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བྱིན་གྱིས་བརླབ་ཏུ་གསོལ།
en: But, Blessed One, just to be sure, we request the Tathāgata to please bless this Dharma discourse so that, among the many beings who will live at that time, those who have created roots of virtue will come to hear about it.”

source: རྫོགས་པའི་སངས་རྒྱས་བདེན་པ་གསུང་། །
en: The true speech of the perfect Buddha.

source: བདེན་པའི་ཆོས་ལ་རབ་ཏུ་གནས། །
en: Since it abides as the true Dharma,

source: བྱིན་གྱི་རླབས་ཀྱིས་དེ་དག་ལ། །མདོ་སྡེ་འདི་ནི་བྱིན་གྱིས་བརླབས། །
en: “This sūtra is blessed for the sake of those future beings. It is blessed

source: སྙིང་རྗེ་ཆེན་པོའི་གོ་ཆ་བགོས། །བྱམས་པ་ཆེན་པོར་རབ་ཏུ་གནས། །ཀུན་ལ་བྱམས་པ་ཉིད་ཀྱི་ཕྱིར། །མདོ་སྡེ་འདི་ནི་བྱིན་གྱིས་བརླབས། །
en: “This sūtra is blessed: Since it is universal love itself, It abides in great love And dons the armor of great compassion.

source: བསོད་ནམས་ཚོགས་ནི་ཕུན་སུམ་ཚོགས། །ཡེ་ཤེས་ཚོགས་ཀྱིས་བྱུང་གྱུར་པ། །ཚོགས་རྣམས་ཀུན་དང་ལྡན་པ་ཡིས། །མདོ་སྡེ་འདི་ནི་བྱིན་གྱིས་བརླབས། །
en: “This sūtra is blessed: It is endowed with all accumulations And emerges through the accumulation of wisdom And the most excellent accumulation of merit.

source: བདུད་རྣམས་ཐམས་ཅད་ངེས་འཇོམས་ལ། སྨྲ་བ་ཐམས་ཅད་རབ་འདུལ་ཞིང་། །ལྟ་བ་ཐམས་ཅད་རྒྱུན་གཅོད་པ། །མདོ་སྡེ་འདི་ནི་བྱིན་གྱིས་བརླབས། །
en: “This sūtra is blessed: It eradicates all philosophical stances, Tames all those who hold dogmatic views, And conquers all demons for good.

source: འཇིག་རྟེན་སྐྱོང་དང་བརྒྱ་བྱིན་དང་། །དེ་བཞིན་ལྷ་མ་ཡིན་རྣམས་དང་། །ལྷ་དང་དྲི་ཟ་ཀླུ་དག་ཀྱང་། །ངས་ནི་བྱིན་གྱིས་བརླབ་པ་བྱས། །
en: “I also bless The protectors of the world, Śakra, And the asuras, the gods, and the demons, As well as the nāgas,

source: ས་དང་དེ་བཞིན་བར་སྣང་ལ། །ལྷ་རྣམས་མང་པོ་གང་འཁོར་བ། །སངས་རྒྱས་རྣམས་ཀྱི་བྱིན་རླབས་ཀྱིས། །ཚུལ་འདི་རབ་ཏུ་འཛིན་པར་འགྱུར། །
en: “The many gods, wherever they are, On the earth as well as in the heavens, So that they will uphold this method By way of the blessings of the buddhas.

source: འཁོར་འདི་བསྲུང་བར་བྱ་བའི་ཕྱིར། །ཚངས་པའི་གནས་པ་རྣམས་ལྡན་ཞིང་། །བདེན་པ་བཞི་ཡིས་བརྒྱན་གྱུར་པ། །མདོ་སྡེ་འདི་ནི་བྱིན་གྱིས་བརླབས། །
en: “This sūtra is blessed With the endowment of the abodes of Brahmā And the adornment of the four noble truths, In order that this assembly may safeguard it.

source: ནམ་མཁའ་གཟུགས་ཅན་བྱེད་ཀྱང་སྲིད། །
en: “It is possible to make space into form,

source: གཟུགས་ནི་གཟུགས་མེད་བྱེད་སྲིད་ཀྱི། །
en: And it is possible to make form formless,

source: སངས་རྒྱས་རྣམས་ཀྱི་བྱིན་རླབས་ནི། །རྣམ་པར་དཀྲུགས་པར་མི་ནུས་སོ། །
en: But it is not possible to tamper With what is blessed by the buddhas.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་རྒྱལ་པོ་ཆེན་པོ་བཞི་པོ་དག་གིས་མགྲིན་གཅིག་ཏུ་ཚིགས་སུ་བཅད་པ་འདི་གཉིས་གསོལ་ཏོ། །
en: Thereupon the Catur­mahā­rājas recited this pair of verses, in unison, to the Blessed One:

source: དེ་བཞིན་གཤེགས་པ་བདག་ཅག་རྣམས། །མདོ་འདི་ཀུན་དུ་བསྲུང་སླད་དུ། །རྩ་ལག་དང་ནི་བཅས་རྣམས་ཀྱིས། །བསྲུང་བ་བཟང་པོ་བགྱི་བར་འཚལ། །
en: “Dear Tathāgata! In order to safeguard this sūtra, We, along with our kin, Pledge to guard it well!

source: མཁས་པ་བྱང་ཆུབ་བློ་གྲོས་ཀྱིས། །གང་དག་འཛིན་པར་བགྱིད་པ་དག །
en: “Those skilled ones who uphold it With awakened intelligence—

source: དེ་དག་ལ་ནི་ཕྱོགས་བཞི་ནས། །རྟག་པར་ཀུན་དུ་བསྲུང་བ་བགྱི། །
en: We pledge to constantly safeguard them From the four directions.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ། ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་ཚིགས་སུ་བཅད་པ་འདི་གཉིས་གསོལ་ཏོ། །
en: Then Śakra, lord of the gods, recited this pair of verses to the Blessed One:

source: བདག་ནི་བཅོམ་ལྡན་མཛད་པ་གཟོ། །
en: “I will repay the kindness of the Blessed One.

source: འདྲེན་པ་ཆོས་ཀྱི་དབང་བདག་ལགས། །
en: He is the guide, the master of the Dharma.

source: མགོན་པོ་མདོ་སྡེ་མཆོག་འདི་ལས། །སངས་རྒྱས་འབྱུང་བ་རབ་ཏུ་བསྟན། །
en: The protector taught that buddhas emerge From this supreme sūtra.

source: སངས་རྒྱས་རྣམས་ནི་ཐམས་ཅད་ཀྱི། །མཛད་པ་གཟོ་བ་བསྲུང་བགྱིད་ཅིང་། །
en: “To repay the kindness of all buddhas, I shall offer my protection.

source: འདི་འདྲའི་མདོ་དང་དེ་བཞིན་དུ། །མདོ་སྡེ་འཛིན་པ་བསྲུང་བར་འཚལ། །
en: I wish to safeguard sūtras such as this, And likewise those who uphold them.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པས་ཚིགས་སུ་བཅད་པ་འདི་གཉིས་གསོལ་ཏོ། །
en: Then Brahmā, ruler of the universe, recited this pair of verses to the Blessed One:

source: བསམ་གཏན་གང་དང་ཚད་མེད་དང་། །ཐེག་པ་ཀུན་གྱིས་འབྱུང་བ་གང་། །དེ་དག་དོན་ལྡན་ཟབ་མོ་ཡི། །མདོ་སྡེ་འདི་ལས་ངེས་པར་འབྱུང་། །
en: “The concentrations and the immeasurables, As well as the goals of all the vehicles, Emerge from this Profound and meaningful sūtra.

source: བདག་ནི་ཚངས་པའི་བདེ་བོར་ཏེ། །གང་ན་ཚུལ་འདི་འཆད་པར་ནི། །མཉན་པའི་སླད་དང་དེ་བཞིན་དུ། །བསྲུང་བའི་སླད་དུ་མཆི་བར་བགྱི། །
en: “I will set out from the bliss of Brahmā And be present to listen And to provide protection Whenever this method is explained.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ལྷའི་བུ་རབ་དགའ་ལྡན་གྱིས་ཚིགས་སུ་བཅད་པ་འདི་གཉིས་གསོལ་ཏོ། །
en: Then Pramodita, the divine being, recited this pair of verses to the Blessed One:

source: གང་ཞིག་སངས་རྒྱས་གསུངས་པ་ཡི། །མདོ་སྡེ་འདི་ནི་འཛིན་འགྱུར་བ། །སྐྱེ་བ་གཅིག་གིས་རབ་གནས་ནས། །དགའ་ལྡན་རྣམས་སུ་གནས་པར་འགྱུར། །
en: “Those who uphold this sūtra That the Buddha has proclaimed Will be born among the Tuṣita gods In their next life.

source: མགོན་པོ་བདག་ནི་ལྷ་ཡུལ་བའི། །ཕུན་སུམ་ཚོགས་པ་བོར་ནས་སུ། །ཚུལ་འདི་རབ་ཏུ་སྟོན་བགྱིད་ཅིང་། །འཛམ་བུ་གླིང་དུ་གནས་པར་སྤྲོ། །
en: “O protector! Once I set out From the most excellent divine realm, I should like to abide in Jambudvīpa And teach this method.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་བདུད་ཀྱི་བུ་དེད་དཔོན་གྱིས་ཚིགས་སུ་བཅད་པ་འདི་གཉིས་གསོལ་ཏོ། །
en: Then Māraputra recited this pair of verses to the Blessed One:

source: གང་ཞིག་གདོན་དང་ལྡན་པ་ཡི། །མདོ་སྡེ་འདི་ནི་འཛིན་འགྱུར་བ། །དེ་དག་བདུད་ལས་འདི་སྤངས་པས། །བདུད་ཀྱི་དབང་དུ་མི་མཆིའོ། །
en: “Those who uphold This meaningful sūtra, Because they have abandoned negative acts, Will not come under the sway of evil,

source: དེ་བཞིན་གཤེགས་པ་བདག་ཀྱང་ནི། །མདོ་འདི་ཀུན་དུ་བསྲུང་སླད་དུ། །ཅི་ནས་ཀྱང་ནི་རྒྱས་འགྱུར་བར། །བརྩོན་བགྱིད་ཅིང་འདུན་བར་བགྱིད། །
en: “O Tathāgata! In order to safeguard this sūtra, I shall also dedicate myself And strive to make it flourish by any means.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་བདུད་སྡིག་ཅན་གྱིས་ཚིགས་སུ་བཅད་པ་འདི་གཉིས་གསོལ་ཏོ། །
en: Then the demon Pāpīyān recited this pair of verses to the Blessed One:

source: རྣམ་པར་འདྲེན་པ་གང་ཞིག་ནི། །ཉོན་མོངས་ཐམས་ཅད་ཚར་གཅོད་པ། །འདི་འཛིན་བགྱིད་པ་དེ་དག་ལ། །བདག་ནི་སྒྲིབ་པར་མི་བགྱིད་དོ། །
en: “Guide! I shall not obstruct Those who uphold this text, Which eradicates all afflictive emotions.

source: མདོ་སྡེ་མཆོག་ནི་འབྱུང་བ་དེར། །བདུད་ཀྱི་གོ་སྐབས་མ་མཆིས་སོ། །
en: “Wherever this supreme sūtra appears, There will be no chance for evil.

source: མགོན་པོས་གསུངས་པ་དྲན་བགྱིད་པ། །དེ་ལ་བསྲུང་བ་བགྱིད་པར་འཚལ། །
en: I wish to give protection to those Who recollect the protectors’ speech.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ལྷའི་བུ་མཚམས་རབ་ཀྱིས་ཚིགས་སུ་བཅད་པ་འདི་གཉིས་གསོལ་ཏོ། །
en: Then the divine being Prasīmā recited this pair of verses to the Blessed One:

source: སངས་རྒྱས་ཀུན་གྱི་བྱང་ཆུབ་ནི། །མདོ་སྡེ་འདི་ལས་རབ་བཤད་པས། །གང་ཞིག་མདོ་སྡེ་འདི་འཛིན་པ། །དེས་ནི་སངས་རྒྱས་ཀུན་ལ་མཆོད། །
en: “Whoever upholds this sūtra Pays homage to all buddhas, Since it explains The awakening of all buddhas.

source: མགོན་པོ་བདག་ནི་མདོ་སྡེ་འདི། །ལྷ་ནི་བྱེ་བ་རྣམས་ལ་བཤད། །
en: “Protector! I shall explain this sūtra To millions of gods.

source: གང་དག་གུས་པར་ཉན་པ་དག །བྱང་ཆུབ་ཡང་དག་འཛིན་དུ་སྩལ། །
en: Whoever listens devotedly Will take hold of awakening.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པས་ཚིགས་སུ་བཅད་པ་འདི་གཉིས་གསོལ་ཏོ། །
en: Then, the bodhisattva Maitreya recited this pair of verses to the Blessed One:

source: མི་གང་བྱང་ཆུབ་རབ་ཞུགས་ཏེ། །དམ་ཆོས་ཡོངས་སུ་བསྲུང་སླད་དུ། །བདག་ཀྱང་སྟོང་བགྱིད་དེ་དག་ནི། །
en: “In order to safeguard the holy Dharma, I will likewise praise People who set out for awakening,

source: གསོལ་བ་མ་བཏབ་བཤེས་གཉེན་ལགས། །
en: And I will act as their unsolicited spiritual guide.

source: བདག་ནི་དགའ་ལྡན་མཆིས་ནས་སུ། །སངས་རྒྱས་ཀྱི་ནི་བྱིན་རླབས་ཀྱིས། །འདི་ལྟ་བུ་ཡི་མདོ་སྡེ་འདི། །ཤིན་ཏུ་རྒྱས་པར་བགྱིད་པར་འཚལ། །
en: “Having resided in Tuṣita, With the Buddha’s blessing I pledge to make this sūtra Flourish widely.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་འོད་སྲུང་ཆེན་པོས་ཚིགས་སུ་བཅད་པ་འདི་གཉིས་གསོལ་ཏོ། །
en: Then the venerable Mahākāśyapa recited this pair of verses to the Blessed One:

source: སྟོན་པ་ལས་ནི་བདག་གིས་སུ། །མདོ་སྡེ་སྟོང་ཕྲག་མང་ཐོས་ཀྱང་། །བདག་གིས་མདོ་སྡེ་འདི་ལྟ་བུ། །སྔོན་ཆད་ནམ་ཡང་མ་ཐོས་སོ། །
en: “Even though I have heard Many thousands of sūtras from the Teacher, I have never before heard A sūtra such as this!

source: མངོན་སུམ་དུ་ནི་མདོ་སྡེ་འདི། །བླངས་ཤིང་ཀུན་དུ་བཟུང་ལགས་ཏེ། །
en: “I have directly received And embraced this sūtra.

source: བྱང་ཆུབ་སེམས་དཔའི་ཆེད་དུ་ནི། །ཤིན་ཏུ་རྒྱས་པར་བགྱི་བར་འཚལ། །
en: I pledge to make it flourish For the sake of bodhisattvas!”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་དེ་དག་དང་། ལྷའི་བུ་དེ་དག་དང་། བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་དང་། ཉན་ཐོས་ཆེན་པོ་དེ་དག་ལ་ལེགས་སོ་ཞེས་བྱ་བ་གནང་སྟེ།
en: Then the Blessed One voiced his approval to Śakra, Brahmā, and the protectors of the world, to the divine beings, to the bodhisattvas, and to the great śrāvakas:

source: སྐྱེས་བུ་དམ་པ་དག་ཁྱེད་ཀྱིས་དམ་པའི་ཆོས་ཡོངས་སུ་བཟུང་བའི་ཕྱིར་འདི་ལྟ་བུའི་སེང་གེའི་སྒྲ་བསྒྲགས་པ་ལེགས་སོ་ལེགས་སོ། །
en: “Excellent, Noble beings! Excellent! Your lion’s roar of proclamation on account of your support for the holy Dharma is excellent.

source: སྐྱེས་བུ་དམ་པ་དག་ཁྱོད་ལ་བསྒོའོ། །ཁྱོད་ཀྱིས་ཁོང་དུ་ཆུད་པར་བྱའོ། །
en: Noble beings, I instruct you: may you master it!

source: སེམས་ཅན་གང་དག་ཐེག་པ་ཆེན་པོ་ལ་ཞུགས་པ་བཟོད་པ་མ་ཐོབ་པ་དེ་དག་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་བྱིན་གྱི་རླབས་ཀྱིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཀུན་དུ་བཟུང་སྟེ། བཟུང་ནས་ཀྱང་ཀུན་ཆུབ་པར་བྱས་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པ་མ་ཐོབ་ཀྱི་བར་དུ་དེ་བཞིན་གཤེགས་པ་བདུན་པ་ལས་འདའ་བར་མི་འགྱུར་རོ། །
en: Those beings who have embarked on the Great Vehicle, who have not attained acceptance, and who have embraced this Dharma discourse with the blessing of the blessed buddhas who have mastered it and comprehended it—they will not pass beyond the seventh tathāgata until they have received their prophecy of awakening.
